data/WS-Addressing/ws-addressing-2.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:073c27ad-a653-44e2-baba-a5118bd15368</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1102</notify></S:Body></S:Envelope>